import React, {Component} from 'react'
import InBetween from './inBetween.js'
import MainNewsItem from './MainNewsItem.js'
import SubNewsItem from './SubNewsItem.js'

class News extends Component {
render() {
  return(
    <main className="new-section">
  		<section className="container">
          <InBetween title={this.props.title} link={this.props.link}/>
          <div className="row">
              <MainNewsItem image={"main-news.png"}
                            title = {"قال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوار"}
                            content = {"قال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوار"}
                            refrence = {"اليوم السابع"}
                            refrence_link = {"#"}
                          />

              <div className="col-lg-6">
                <div className="row sub-news-row">
                    <SubNewsItem image={"main-news.png"}
                                 title = {"قال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوار"}
                                 refrence = {"اليوم السابع"}
                                 refrence_link = {"#"}
                              />

                    <SubNewsItem image={"main-news.png"}
                                 title = {"قال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوار"}
                                 refrence = {"اليوم السابع"}
                                 refrence_link = {"#"}
                              />
                </div>

                <div className="row">
                  <SubNewsItem image={"main-news.png"}
                               title = {"قال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوار"}
                               refrence = {"اليوم السابع"}
                               refrence_link = {"#"}
                            />
                  <SubNewsItem image={"main-news.png"}
                               title = {"قال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوار"}
                               refrence = {"اليوم السابع"}
                               refrence_link = {"#"}
                            />
                </div>
              </div>
          </div>
      </section>
  </main>
  );
}
};

export default News;
