import React, {Component} from 'react'
import Header from './mostshar-page-components/header.js'
import Bio from './mostshar-page-components/bio.js'
import News from './mostshar-page-components/News.js'
import Qoutation from './shared/qoutation_slider.js'
import '../css/bootstrap.css';
import '../css/mostshar-page-style.css';
import '../css/qoutation_slider.css';

class Home extends Component {
    constructor(props)
    {
      super(props);
      this.state = {
        bio : [
          {
          id : 1,
          title : "مولده و تعليمه",
          content : "ولد الشيخ احمد الطيب بالمراشدة فى دشنا بقنا جنوب مصر.والتحق الطيب بجامعة الازهر حتى حصل على شهادة الليسانس فى العقيدة و الفلسفة عام 1969 ثم شهادة الماجستير عام ... ولد الشيخ احمد الطيب بالمراشدة فى دشنا بقنا جنوب مصر.والتحق الطيب بجامعة الازهر حتى حصل على شهادة الليسانس فى العقيدة و الفلسفة عام 1969 ثم شهادة الماجستير عام ...ولد الشيخ احمد الطيب بالمراشدة فى دشنا بقنا جنوب مصر.والتحق الطيب بجامعة الازهر حتى حصل على شهادة الليسانس فى العقيدة",
        },
        {
        id : 1,
        title : "مولده و تعليمه",
        content : "ولد الشيخ احمد الطيب بالمراشدة فى دشنا بقنا جنوب مصر.والتحق الطيب بجامعة الازهر حتى حصل على شهادة الليسانس فى العقيدة و الفلسفة عام 1969 ثم شهادة الماجستير عام ... ولد الشيخ احمد الطيب بالمراشدة فى دشنا بقنا جنوب مصر.والتحق الطيب بجامعة الازهر حتى حصل على شهادة الليسانس فى العقيدة و الفلسفة عام 1969 ثم شهادة الماجستير عام ...ولد الشيخ احمد الطيب بالمراشدة فى دشنا بقنا جنوب مصر.والتحق الطيب بجامعة الازهر حتى حصل على شهادة الليسانس فى العقيدة",
        },
        {
        id : 2,
        title : "مولده و تعليمه",
        content : "ولد الشيخ احمد الطيب بالمراشدة فى دشنا بقنا جنوب مصر.والتحق الطيب بجامعة الازهر حتى حصل على شهادة الليسانس فى العقيدة و الفلسفة عام 1969 ثم شهادة الماجستير عام ... ولد الشيخ احمد الطيب بالمراشدة فى دشنا بقنا جنوب مصر.والتحق الطيب بجامعة الازهر حتى حصل على شهادة الليسانس فى العقيدة و الفلسفة عام 1969 ثم شهادة الماجستير عام ...ولد الشيخ احمد الطيب بالمراشدة فى دشنا بقنا جنوب مصر.والتحق الطيب بجامعة الازهر حتى حصل على شهادة الليسانس فى العقيدة",
      },
      {
      id : 3,
      title : "مولده و تعليمه",
      content : "ولد الشيخ احمد الطيب بالمراشدة فى دشنا بقنا جنوب مصر.والتحق الطيب بجامعة الازهر حتى حصل على شهادة الليسانس فى العقيدة و الفلسفة عام 1969 ثم شهادة الماجستير عام ... ولد الشيخ احمد الطيب بالمراشدة فى دشنا بقنا جنوب مصر.والتحق الطيب بجامعة الازهر حتى حصل على شهادة الليسانس فى العقيدة و الفلسفة عام 1969 ثم شهادة الماجستير عام ...ولد الشيخ احمد الطيب بالمراشدة فى دشنا بقنا جنوب مصر.والتحق الطيب بجامعة الازهر حتى حصل على شهادة الليسانس فى العقيدة",
      }
    ]
      }
    }
    render() {
        return (
            <div>
                  <Header/>
                  <Bio title={"title-bio.png"} link={"/bio"}/>
                  <News title={"title-news.png"} link={"/news"}/>
                  <Qoutation image={"human2.png"}/>
            </div>
        )
    }
}

export default Home
