import React, {Component} from 'react'
import MainNewsDetailsLoader from './Loaders/MainNewsDetailsLoader.js'
import StickySubNewsLoader from './Loaders/StickySubNewsDetails.js'

import '../css/bootstrap.css';
import '../css/newsDetails.css'

class NewDetails extends Component {
  constructor(props)
  {
    super(props);
    this.state = {
      mainNews : [],
      subNews : []
    }
  }

  componentWillMount()
  {
    this.setState({
      subNews : [
        {id:1 , title:"قال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوار" ,image:"human.png" , refrence:"اليوم السابع",refrence_link:"#"},
        {id:2 , title:"قال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوار" ,image:"human.png" , refrence:"اليوم السابع",refrence_link:"#"}
      ],
      mainNews : [
        {id:1 , image:"main-news.png" , date:"5 مايو 2018" , title:"قال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوار" , content:"قال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوار"},
        {id:2 , image:"main-news.png" , date:"5 مايو 2018" , title:"قال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوار" , content:"قال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم, استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوار"}
      ]
    });
  }

    render() {
        return (
          <section className="news-details-body">
            <div className="container">
                <div className="row">
                    <div className="col-lg-1"></div>
                      <StickySubNewsLoader SubNews={this.state.subNews}/>
                      <MainNewsDetailsLoader MainNews={this.state.mainNews}/>
                    <div className="col-lg-1"></div>
  		           </div>
  	        </div>
          </section>
        )
    }
}

export default NewDetails;
