import React, {Component} from 'react'
import LoadSearchResults from '../Loaders/LoadSearchResults'
import Qoutation from '../shared/qoutation_slider.js'
import '../../css/search-results.css';
import InBetween from '../mostshar-page-components/inBetween.js'

class SearchResults extends Component {
  constructor(props)
  {
    super(props);
    this.state = {
      results : []
    }
  }

  componentWillMount()
  {
    this.setState({
        results : [
          {id:1 , title:"قال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوار" ,image:"human.png" , refrence:"اليوم السابع",refrence_link:"#"},
          {id:2 , title:"قال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوار" ,image:"human.png" , refrence:"اليوم السابع",refrence_link:"#"},
          {id:3 , title:"قال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوار" ,image:"human.png" , refrence:"اليوم السابع",refrence_link:"#"},
          {id:4 , title:"قال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوار" ,image:"human.png" , refrence:"اليوم السابع",refrence_link:"#"},
          {id:5 , title:"قال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوار" ,image:"human.png" , refrence:"اليوم السابع",refrence_link:"#"},
          {id:6 , title:"قال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوار" ,image:"human.png" , refrence:"اليوم السابع",refrence_link:"#"},
          {id:7 , title:"قال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوارقال فضيله الامام الاكبر : ان القرأن الكريم استعمل منذ البدايه اسلوب الحوار" ,image:"human.png" , refrence:"اليوم السابع",refrence_link:"#"},
        ]
    });
  }

    render() {
        return (
          <section className="search-section search-results-body">
		            <div className="container">
                      <InBetween title={"serach-result-title.png"} link={""} isHidden={"true"}/>
                      <LoadSearchResults results={this.state.results} />
                </div>
                <div className="search-results-slider">
                <Qoutation image={"human2.png"}/>
              </div>
          </section>
        )
    }
}

export default SearchResults;
